//學號：3B052047
//姓名：黃宇航
//色彩的意象(新潮的，热情的，神秘的，纯真的，活潑的，典雅的)
function setup() {
  createCanvas(400, 400);
}

function draw() {
  background(220);
  stroke(139, 69, 19);
  strokeWeight(5);
  fill(224, 255, 255);
  rect(65, 80, 270, 270);
  fill(220, 20, 60);
  ellipse(200, 200, 110, 100);
  fill(255, 228, 225);
  triangle(200, 180, 160, 290, 240, 290);
  fill(240, 248, 255);
  circle(70, 100, 90);
  fill(240, 248, 255);
  circle(330, 320, 90);
  fill(0, 128, 128);
  triangle(55, 61, 55, 140, 110, 100);
  fill(123, 104, 238);
  triangle(320, 280, 370, 320, 320, 360);
  fill(255, 215, 0);
  rect(306, 130, 55, 55);
  fill(255, 0, 255);
  circle(65, 298, 20);
}
