//3B052019
//陳學廷
//紅、黃、藍、黑的構成

function setup() {
  createCanvas(380, 370);
}

  function draw() {
    background(220);
    noStroke();
  fill('rgb(230,230,250)');//淺藍矩1
  rect(0, 0, 86.5, 35);
  fill('rgb(240,240,240)');//白矩1
  rect(87.5, 0, 145, 35);
  fill('rgb(250,220,100)');//黃矩1
  rect(230, 0, 120, 130);
  fill('rgb(230,230,250)');//淺藍矩2
  rect(350, 0, 120, 280);
  fill('rgb(240,240,240)');//白矩2
  rect(0, 35, 40, 100);
  fill('rgb(250,50,50)');//紅矩1
  rect(40, 35, 190, 190);
  fill('rgb(230,230,250)');//淺藍矩3
  rect(0, 135, 40, 140);
  fill('rgb(240,240,240)');//白矩3
  rect(230, 135, 120, 140);
  fill('rgb(20,20,20)');//黑矩1
  rect(40, 230, 100, 100);
  fill('rgb(230,230,250)');//淺藍矩4
  rect(140, 230, 95, 95);
  fill('rgb(250,220,100)');//黃矩2
  rect(0, 275, 40, 140);
  fill('rgb(230,230,250)');//淺藍矩5
  rect(40, 330, 95, 95);
  fill('rgb(20,20,20)');//黑矩2
  rect(135, 330, 95, 20);
  fill('rgb(50,50,200)');//藍矩1
  rect(230, 275, 120, 80);
  fill('rgb(250,50,50)');//紅矩2
  rect(350, 275, 120, 200);
  fill('rgb(240,240,240)');//白矩4
  rect(135, 350, 210, 200);
  fill('rgb(0,0,0)')
  rect(40, 35, 5,400);//直1
  fill('rgb(0,0,0)')
  rect(87.5, 0, 5,40);//直2
  fill('rgb(0,0,0)')
  rect(87.5, 225, 5,105);//直3
  fill('rgb(0,0,0)')
  rect(135, 225, 5,400);//直4
  fill('rgb(0,0,0)')
  rect(230, 0, 5,355);//直5
  fill('rgb(0,0,0)')
  rect(287.5, 135, 5,95);//直6
  fill('rgb(0,0,0)')
  rect(345, 0, 5,400);//直7
  fill('rgb(0,0,0)')
  rect(0, 35, 350, 5);//橫1
  fill('rgb(0,0,0)')
  rect(0, 130, 40, 5);//橫2
  fill('rgb(0,0,0)')
  rect(230, 130, 120, 5);//橫3
  fill('rgb(0,0,0)')
  rect(40, 225, 310, 5);//橫4
  fill('rgb(0,0,0)')
  rect(0, 275, 400, 5);//橫5
  fill('rgb(0,0,0)')
  rect(40, 325, 190, 5);//橫6
  fill('rgb(0,0,0)')
  rect(135, 350, 210, 5);//橫7
}


 
